misc/benchmark/artillery-azure.yml
config:
  target: "http://13.66.231.26:4000/"
  phases:
    - duration: 100
      arrivalRate: 1
scenarios:
  - engine: "socketio"
    flow:
      - emit:
          channel: "evaluate"
          data: { code: "[1,2,3].map(&:to_s)" }
          response:
            channel: "output"
      - think: 1