misc/benchmark/artillery-droplet.yml
config:
  target: "http://178.128.129.50:4000/"
  phases:
    - duration: 100
      arrivalRate: 1
scenarios:
  - engine: "socketio"
    flow:
      - emit:
          channel: "evaluate"
          data: { code: "[1,2,3].map(&:to_s)" }
          response:
            channel: "output"
      - think: 1