misc/benchmark/artillery-gooi.yml
config:
  target: "http://174.138.50.119:3000/"
  phases:
    - duration: 300
      arrivalRate: 1
scenarios:
  - engine: "socketio"
    flow:
      - emit:
          channel: "evaluate"
          data: { code: "[1,2,3].map(&:to_s)" }
          response:
            channel: "output"
      - think: 1